/*  document.getElementById('korzina').onclick = function() { 
  alert("Товар успешно добавлен в корзину!"); 
} */

var priceList = {
    "001" : {"id" : "001", "subid" : {}, "name" : "Академическая шапочка выпускника, всех цветов", "price" : "250"},
    "002" : {"id" : "002", "subid" : {}, "name" : "Детская мантия и квадратная шапочка выпускника", "price" : "700"},
    "003" : {"id" : "003", "subid" : {}, "name" : "Комплект магистра", "price" : "1550"},
    "004" : {"id" : "004", "subid" : {}, "name" : "Мантия и шапочка выпускника, черная", "price" : "1200"},
    "005" : {"id" : "005", "subid" : {}, "name" : "Мантия и шапочка детская, облегченная", "price" : "3250"},
    "006" : {"id" : "006", "subid" : {}, "name" : "Мантия и шапочка детская, облегченная синяя", "price" : "4250"},
    "007" : {"id" : "007", "subid" : {}, "name" : "Шапочка бархатная", "price" : "1000"},
    "008" : {"id" : "008", "subid" : {}, "name" : "Шапочка выпускника черная, блестящая", "price" : "250"},
    "009" : {"id" : "009", "subid" : {}, "name" : "Академическая одежда белая", "price" : "1200"},
    "010" : {"id" : "010", "subid" : {}, "name" : "Академическая одежда бордовая", "price" : "1290"},
    "011" : {"id" : "011", "subid" : {}, "name" : "Академическая одежда желтая", "price" : "1090"},
    "012" : {"id" : "012", "subid" : {}, "name" : "Академическая одежда зеленая", "price" : "1390"},
    "013" : {"id" : "013", "subid" : {}, "name" : "Академическая одежда красная", "price" : "1190"},
    "014" : {"id" : "014", "subid" : {}, "name" : "Академическая одежда оранжевая", "price" : "1290"},
    "015" : {"id" : "015", "subid" : {}, "name" : "Академическая одежда светло-серая", "price" : "1200"},
    "016" : {"id" : "016", "subid" : {}, "name" : "Академическая одежда синяя", "price" : "1290"},
    "017" : {"id" : "017", "subid" : {}, "name" : "Академическая одежда темно-синяя", "price" : "1290"},
    "018" : {"id" : "018", "subid" : {}, "name" : "Академическая одежда фиолетовая", "price" : "1390"},
    "019" : {"id" : "019", "subid" : {}, "name" : "Галстук всех цветов", "price" : "150"},
    "020" : {"id" : "020", "subid" : {}, "name" : "Галстук-капюшон всех цветов", "price" : "200"},
    "021" : {"id" : "021", "subid" : {}, "name" : "Мантия и шапочка выпускника, голубые", "price" : "1990"}
    };
    
var cart;
var config;
var wiNumInputPrefID;

$(document).ready(function(){  
 
    cart = new WICard("cart");
    cart.init("basketwidjet", config);
    
    
});    
document.addEventListener('visibilitychange', function(e) {
cart.init("basketwidjet", config);
}, false);